zephyrproject-rtos/hal_espressif/zephyr/esp32c3/src/bt/esp_bt_adapter.c
	return err;
}

esp_err_t esp_bt_controller_deinit(void)
{
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_INITED) {
		return ESP_ERR_INVALID_STATE;
	}

	btdm_controller_deinit();

	bt_controller_deinit_internal();

	return ESP_OK;
}

static void bt_controller_deinit_internal(void)
{
	periph_module_disable(PERIPH_BT_MODULE);

	if (s_lp_stat.phy_enabled) {
		esp_phy_disable(PHY_MODEM_BT);
		s_lp_stat.phy_enabled = 0;
	}

	// deinit low power control resources
	do {

#if CONFIG_MAC_BB_PD
		if (s_lp_cntl.mac_bb_pd) {
			btdm_deep_sleep_mem_deinit();
			s_lp_cntl.mac_bb_pd = 0;
		}
#endif

		if (s_lp_cntl.wakeup_timer_required) {
			if (s_lp_stat.wakeup_timer_started) {
				esp_timer_stop(s_btdm_slp_tmr);
			}
			s_lp_stat.wakeup_timer_started = 0;
			esp_timer_delete(s_btdm_slp_tmr);
			s_btdm_slp_tmr = NULL;
		}

		if (s_lp_cntl.enable) {
			btdm_vnd_offload_task_deregister(BTDM_VND_OL_SIG_WAKEUP_TMR);
			if (s_wakeup_req_sem != NULL) {
				semphr_delete_wrapper(s_wakeup_req_sem);
				s_wakeup_req_sem = NULL;
			}
		}

		if (s_lp_cntl.lpclk_sel == BTDM_LPCLK_SEL_XTAL) {
#ifdef CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP
			if (s_lp_cntl.main_xtal_pu) {
				esp_sleep_pd_config(ESP_PD_DOMAIN_XTAL, ESP_PD_OPTION_OFF);
				s_lp_cntl.main_xtal_pu = 0;
			}
#endif
			btdm_lpclk_select_src(BTDM_LPCLK_SEL_RTC_SLOW);
			btdm_lpclk_set_div(0);
#if CONFIG_SW_COEXIST_ENABLE
			coex_update_lpclk_interval();
#endif
		}

		btdm_lpcycle_us = 0;
	} while (0);

#if CONFIG_MAC_BB_PD
	esp_unregister_mac_bb_pd_callback(btdm_mac_bb_power_down_cb);
	esp_unregister_mac_bb_pu_callback(btdm_mac_bb_power_up_cb);
#endif

	esp_bt_power_domain_off();
#if CONFIG_MAC_BB_PD
	esp_mac_bb_pd_mem_deinit();
#endif
	esp_phy_modem_deinit();

	if (osi_funcs_p != NULL) {
		esp_bt_free(osi_funcs_p);
		osi_funcs_p = NULL;
	}

	btdm_controller_status = ESP_BT_CONTROLLER_STATUS_IDLE;
}

esp_err_t esp_bt_controller_enable(esp_bt_mode_t mode)
{
	int ret = ESP_OK;

	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_INITED) {
		return ESP_ERR_INVALID_STATE;
	}

	/* As the history reason, mode should be equal to the mode which set in esp_bt_controller_init() */
	if (mode != btdm_controller_get_mode()) {
		return ESP_ERR_INVALID_ARG;
	}

#if CONFIG_SW_COEXIST_ENABLE
	coex_enable();
#endif

	// enable low power mode
	do {
		if (s_lp_cntl.enable) {
			btdm_controller_enable_sleep(true);
		}
	} while (0);

	if (btdm_controller_enable(mode) != 0) {
		ret = ESP_ERR_INVALID_STATE;
		goto error;
	}

	btdm_controller_status = ESP_BT_CONTROLLER_STATUS_ENABLED;

	return ret;

error:
	// disable low power mode
	do {
		btdm_controller_enable_sleep(false);
	} while (0);

#if CONFIG_SW_COEXIST_ENABLE
	coex_disable();
#endif

	return ret;
}

esp_err_t esp_bt_controller_disable(void)
{
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED) {
		return ESP_ERR_INVALID_STATE;
	}

	async_wakeup_request(BTDM_ASYNC_WAKEUP_SRC_DISA);
	while (!btdm_power_state_active()){}
	btdm_controller_disable();

	async_wakeup_request_end(BTDM_ASYNC_WAKEUP_SRC_DISA);

#if CONFIG_SW_COEXIST_ENABLE
	coex_disable();
#endif

	btdm_controller_status = ESP_BT_CONTROLLER_STATUS_INITED;

	return ESP_OK;
}

esp_bt_controller_status_t esp_bt_controller_get_status(void)
{
	return btdm_controller_status;
}

/* extra functions */
esp_err_t esp_ble_tx_power_set(esp_ble_power_type_t power_type, esp_power_level_t power_level)
{
	esp_err_t stat = ESP_FAIL;

	switch (power_type) {
	case ESP_BLE_PWR_TYPE_ADV:
	case ESP_BLE_PWR_TYPE_SCAN:
	case ESP_BLE_PWR_TYPE_DEFAULT:
		if (ble_txpwr_set(power_type, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	default:
		stat = ESP_ERR_NOT_SUPPORTED;
		break;
	}

	return stat;
}

esp_power_level_t esp_ble_tx_power_get(esp_ble_power_type_t power_type)
{
	esp_power_level_t lvl;

	switch (power_type) {
	case ESP_BLE_PWR_TYPE_ADV:
	case ESP_BLE_PWR_TYPE_SCAN:
		lvl = (esp_power_level_t)ble_txpwr_get(power_type);
		break;
	case ESP_BLE_PWR_TYPE_CONN_HDL0:
	case ESP_BLE_PWR_TYPE_CONN_HDL1:
	case ESP_BLE_PWR_TYPE_CONN_HDL2:
	case ESP_BLE_PWR_TYPE_CONN_HDL3:
	case ESP_BLE_PWR_TYPE_CONN_HDL4:
	case ESP_BLE_PWR_TYPE_CONN_HDL5:
	case ESP_BLE_PWR_TYPE_CONN_HDL6:
	case ESP_BLE_PWR_TYPE_CONN_HDL7:
	case ESP_BLE_PWR_TYPE_CONN_HDL8:
	case ESP_BLE_PWR_TYPE_DEFAULT:
		lvl = (esp_power_level_t)ble_txpwr_get(ESP_BLE_PWR_TYPE_DEFAULT);
		break;
	default:
		lvl = ESP_PWR_LVL_INVALID;
		break;
	}

	return lvl;
}

esp_err_t esp_bt_sleep_enable (void)
{
	esp_err_t status;
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED) {
		return ESP_ERR_INVALID_STATE;
	}
	if (btdm_controller_get_sleep_mode() == ESP_BT_SLEEP_MODE_1) {
		btdm_controller_enable_sleep (true);
		status = ESP_OK;
	} else {
		status = ESP_ERR_NOT_SUPPORTED;
	}

	return status;
}

esp_err_t esp_bt_sleep_disable (void)
{
	esp_err_t status;
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED) {
		return ESP_ERR_INVALID_STATE;
	}
	if (btdm_controller_get_sleep_mode() == ESP_BT_SLEEP_MODE_1) {
		btdm_controller_enable_sleep (false);
		status = ESP_OK;
	} else {
		status = ESP_ERR_NOT_SUPPORTED;
	}

	return status;
}

bool esp_bt_controller_is_sleeping(void)
{
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED ||
			btdm_controller_get_sleep_mode() != ESP_BT_SLEEP_MODE_1) {
			return false;
	}

	return !btdm_power_state_active();
}

void esp_bt_controller_wakeup_request(void)
{
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED ||
			btdm_controller_get_sleep_mode() != ESP_BT_SLEEP_MODE_1) {
			return;
	}

	btdm_wakeup_request();
}

int IRAM_ATTR esp_bt_h4tl_eif_io_event_notify(int event)
{
	return btdm_hci_tl_io_event_post(event);
}

uint16_t esp_bt_get_tx_buf_num(void)
{
	return l2c_ble_link_get_tx_buf_num();
}

static void coex_wifi_sleep_set_hook(bool sleep)
{

}

static void esp_bt_free(void *mem)
{
	esp_bt_free_func(mem);
}

static uint32_t coex_schm_interval_get_wrapper(void)
{
#if CONFIG_SW_COEXIST_ENABLE
	return coex_schm_interval_get();
#else
	return 0;
#endif
}

static uint8_t coex_schm_curr_period_get_wrapper(void)
{
#if CONFIG_SW_COEXIST_ENABLE
	return coex_schm_curr_period_get();
#else
	return 1;
#endif
}

static void * coex_schm_curr_phase_get_wrapper(void)
{
#if CONFIG_SW_COEXIST_ENABLE
	return coex_schm_curr_phase_get();
#else
	return NULL;
#endif
}